import s from "./Program.module.css";

export const Program = () => {
    return (
        <section className={s.container}>
            <h2>Программа курса Roblox для детей</h2>
            <div>
                <div>
                    <h3 className={s.title}>Модуль 1: Игра на выживание</h3>
                    <p>Урoк 1: Знакомство с Roblox Studio <br />
                        Урок 2: Продвинутые инструменты редактирования местности. Изучение ToolBox <br />
                        Урок 3: Проектирование трёхмерных моделей с использованием блоков и других базовых объектов <br />
                        Урoк 4: Основы программирования для детей. Узнаём о переменных и о том, как изменять их значения <br />
                        ‍<br />
                        Ученики создадут первую программу с нуля и узнают основные понятия геймдизайна, моделирования и кодинга. Доработают проект с помощью Toolbox в Studio и опубликуют его.</p>
                </div>
                <div>
                    
                </div>
            </div>
            <div>
                <div>
                    <h3 className={s.title}>Модуль 2: Tower of the Hell</h3>
                    <p>Урок 1: Основы программирования. Функции и условный оператор
                        Урок 2: Сложные инструменты для моделирования
                        Урок 3: Изучение физики
                        Урок 4: Изучение анимации
                        ‍
                        Ученики изучат физику в Roblox Studio. Научатся взаимодействовать с объектами с помощью специальных кнопок. Исследуют пользовательский интерфейс. Создадут собственный плейс "Tower of the Hell".</p>
                </div>
                <div>
                </div>
            </div>
            <div>
                <div>
                    <h3 className={s.title}>Модуль 3: Жанр «Гонки»</h3>
                    <p>Урок 1: Знакомство с основами геймдизайна
                        Урок 2: Основы написания скриптов
                        Урок 3: Добавление визуальных эффектов
                        Урок 4: Объекты в игре
                        ‍
                        Ученики расширят свои знания о программировании на языке LUA в Studio. Поймут, как действуют функции, и научатся применять условия. Узнают, как работать с источниками света. Создадут свои гонки.</p>
                </div>
                <div>
                </div>
            </div>
            <div>
                <div>
                    <h3 className={s.title}>Модуль 4: Жанр «Приключения». Командная разработка для детей</h3>
                    <p>Урок 1: Знакомство с командной разработкой
                        Урок 2: Создаём объекты для строительства и настраиваем их с помощью сложных скриптов
                        Урок 3: Разрабатываем инструменты для сбора материалов
                        Урок 4: Изучение основ монетизации
                        ‍
                        Ученики научатся взаимодействию в команде. Узнают, как добавить внутриигровую валюту и обменивать её на способности. Напишут первую программу для плейса: чат для общения между игроками.</p>
                </div>
                <div>
                </div>
            </div>
            <div>
                <div>
                    <h3 className={s.title}>Модуль 5: Жанр «Детектив». Начало разработки</h3>
                    <p>Урок 1: Геймдизайн. Проработка плана локации для новой игры
                        Урок 2: Построение локации и Лобби. Закрепляем опыт моделирования локаций
                        Урок 3: Разработка инструмента ― меч. Изучаем функции LUA для взаимодействия с инструментами
                        Урок 4: Изучаем события в Studio, с помощью которых добавляем анимации и реализуем комбо-атаку для меча
                        ‍
                        Ученики изучат, как применять свои инструменты в Studio. Научатся работать с анимацией и звуками. Узнают, как работать с событиями в Roblox. Разберутся, что такое геймдизайн и начнут создавать большой проект.</p>
                </div>
                <div>
                </div>
            </div>
            <div>
                <div>
                    <h3 className={s.title}>Модуль 6: Углубляемся в LUA</h3>
                    <p>Урок 1: Знакомство с циклом «while»
                        Урок 2: Клонирование объектов
                        Урок 3: Изучение цикла «for»
                        Урок 4: Трёхмерное моделирование. Знакомство с программой Tinkercad
                        ‍
                        Ученики изучат язык LUA в Roblox Studio. Научатся применять события и циклы, клонировать объекты. Познакомятся с основами 3D-моделирования.</p>
                </div>
                <div>
                </div>
            </div>
            <div>
                <div>
                    <h3 className={s.title}>Модуль 7: Пользовательский интерфейс</h3>
                    <p>Урок 1: Работа с пользовательским интерфейсом (GUI). Программируем таймер
                        Урок 2: Окончание раунда. Учимся создавать условия окончания игры
                        Урок 3: Изучаем взаимодействие событий и GUI
                        Урок 4: Дорабатываем наш большой проект
                        ‍
                        Ученики освоят, как работать с пользовательским интерфейсом. Повторят действие событий в Roblox. Закрепят навыки программирования на языке LUA. Закончат работу над проектом и опубликуют его.</p>
                </div>
                <div>
                </div>
            </div>
            <div>
                <div>
                    <h3 className={s.title}>Модуль 8: Разработка проекта в Roblox</h3>
                    <p>Урок 1: Основы геймдизайна. Проектирование концепта документа для своей игры
                        Урок 2: Монетизация. Изучаем Gamepass
                        Урок 3: Финальное тестирование  проекта
                        Урок 4: Презентация проектов. Выпускной
                        ‍
                        Ученики разработают свою оригинальную игру в Roblox. Объединят различные гейм механики и сценарии. Протестируют проект и представят его на выпускном.</p>
                </div>
                <div>
                </div>
            </div>
        </section>
    );
};
